Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Each proxy class has one public constructor that takes one argument, an implementation of the interface InvocationHandler, to set the invocation handler for a proxy instance.
zh_cn: 每个代理类都有一个可以带一个参数（接口 InvocationHandler 的实现）的公共构造方法，用于设置代理实例的调用处理程序。

source: Each proxy instance has an associated invocation handler object, which implements the interface InvocationHandler.
zh_cn: 每个代理实例都有一个关联的调用处理程序 对象，它可以实现接口 InvocationHandler。

source: Each proxy instance has an associated invocation handler, the one that was passed to its constructor.
zh_cn: 每个代理实例都有一个关联的调用处理程序，它会被传递到其构造方法中。

source: Each proxy instance has an associated invocation handler.
zh_cn: 每个代理实例都具有一个关联的调用处理程序。

source: Each reference-object type is implemented by a subclass of the abstract base Reference class.
zh_cn: 每种引用对象类型都是通过抽象的基本 Reference 类的一个子类实现的。

source: Each thread holds an implicit reference to its copy of a thread-local variable as long as the thread is alive and the ThreadLocal instance is accessible; after a thread goes away, all of its copies of thread-local instances are subject to garbage collection (unless other references to these copies exist).
zh_cn: 每个线程都保持对其线程局部变量副本的隐式引用，只要线程是活动的并且 ThreadLocal 实例是可访问的；在线程消失之后，其线程局部实例的所有副本都会被垃圾回收（除非存在对这些副本的其他引用）。

source: Each thread may or may not also be marked as a daemon.
zh_cn: 每个线程都可以或不可以标记为一个守护程序。

source: Each type corresponds to a different level of reachability, as defined below.
zh_cn: 正如下面定义的那样，每种类型对应于一个不同的可到达性级别。

source: Enables/Disables tracing of instructions.
zh_cn: 启用／禁用指令跟踪。

source: Enables/Disables tracing of method calls.
zh_cn: 启用／禁用方法调用跟踪。

source: Encodes this String into a sequence of bytes using the given charset, storing the result into a new byte array.
zh_cn: 使用给定的 charset 将此 String 编码到 byte 序列，并将结果存储到新的 byte 数组。

source: Encodes this String into a sequence of bytes using the named charset, storing the result into a new byte array.
zh_cn: 使用指定的字符集将此 String 编码为 byte 序列，并将结果存储到一个新的 byte 数组中。

source: Encodes this String into a sequence of bytes using the platform's default charset, storing the result into a new byte array.
zh_cn: 使用平台的默认字符集将此 String 编码为 byte 序列，并将结果存储到一个新的 byte 数组中。

source: Ensures that the capacity is at least equal to the specified minimum.
zh_cn: 确保容量至少等于指定的最小值。

source: Ensures that the given root is the first node of its bin.
zh_cn: 确保给定的根是它的 bin 的第一个节点。

source: Entry for Tree bins.
zh_cn: Tree bins 的条目

source: Enum constants are only comparable to other enum constants of the same enum type.
zh_cn: 枚举常量只能与相同枚举类型的其他枚举常量进行比较。

source: Enum for locale categories.
zh_cn: 语言环境类别的枚举。

source: Enums
zh_cn: 枚举

source: Error thrown when something goes wrong while loading a service provider.
zh_cn: 在加载服务提供者的过程中出错时抛出的错误。

source: Errors
zh_cn: 错误

source: Even if the clone method is invoked reflectively, there is no guarantee that it will succeed.
zh_cn: 即使 clone 方法是反射性调用的，也无法保证它将获得成功。

source: Even though a type variable is created only once, this does not imply any requirement to cache instances representing the type variable.
zh_cn: 尽管类型变量仅创建一次，这并不意味着任何缓存实例的要求都表示类型变量。

source: Every Class object contains a reference to the ClassLoader that defined it.
zh_cn: 每个 Class 对象都包含一个对定义它的 ClassLoader 的 引用。

source: Every Java application has a single instance of class Runtime that allows the application to interface with the environment in which the application is running.
zh_cn: 每个 Java 应用程序都有一个 Runtime 类实例，使应用程序能够与其运行的环境相连接。

source: Every Unicode character is assigned to a single Unicode script, either a specific script, such as Latin, or one of the following three special values, Inherited, Common or Unknown.
zh_cn: 每 Unicode 字符被分配给单个 Unicode 脚本，无论是特定的脚本，例如 Latin 或以下三个特殊值中的一个，Inherited，Common 或 Unknown。

source: Every array also belongs to a class that is reflected as a Class object that is shared by all arrays with the same element type and number of dimensions.
zh_cn: 每个数组属于被映射为 Class 对象的一个类，所有具有相同元素类型和维数的数组都共享该 Class 对象。

source: Every class has Object as a superclass.
zh_cn: 每个类都使用 Object 作为超类。

source: Every reference object provides methods for getting and clearing the reference.
zh_cn: 每个引用对象都提供了获取和清除该引用的方法。

source: Every string buffer has a capacity.
zh_cn: 每个字符串缓冲区都有一定的容量。

source: Every string builder has a capacity.
zh_cn: 每个字符串生成器都有一定的容量。

source: Every thread has a name for identification purposes.
zh_cn: 每个线程都有一个标识名。

source: Every thread has a priority.
zh_cn: 每个线程都有一个优先级。

source: Examples of valid class names include:
zh_cn: 有效类名称的示例包括：

source: Exception indicating that the result of a value-producing task, such as a FutureTask, cannot be retrieved because the task was cancelled.
zh_cn: 如果某项值生成任务（如 FutureTask）的结果因为任务被取消而无法获取到，则抛出该异常。

source: Exception indicating the failure of an object read operation due to unread primitive data, or the end of data belonging to a serialized object in the stream.
zh_cn: 指示对象读取操作失败的异常，原因是无法读取流中的基本数据或已序列化对象的数据末尾。

source: Exception thrown by an Executor when a task cannot be accepted for execution.
zh_cn: 当无法执行某个任务时,由 Executor 抛出的异常。

source: Exception thrown when a blocking operation times out.
zh_cn: 阻塞操作超时时，抛出该异常。

source: Exception thrown when a thread tries to wait upon a barrier that is in a broken state, or which enters the broken state while the thread is waiting.
zh_cn: 当某个线程试图等待处于断开状态的 barrier 时，或者 barrier 进入断开状态而线程处于等待状态时，抛出该异常。

source: Exception thrown when an error or other exception is encountered in the course of completing a result or task.
zh_cn: 当完成一个结果或任务的过程中遇到错误或其他异常抛出异常。

source: Exception thrown when attempting to retrieve the result of a task that aborted by throwing an exception.
zh_cn: 当试图获取已通过抛出异常而中止的任务的结果时，抛出此异常。

source: Exceptions
zh_cn: 异常

source: Exceptions thrown by the action are relayed to the caller.
zh_cn: 操作引发的异常将转达到调用方。

source: Exceptions thrown by the function are relayed to the caller.
zh_cn: 函数引发的异常将转达到调用方。

source: Executes the given command at some time in the future.
zh_cn: 在将来某个时间执行给定任务。

source: Executes the given task sometime in the future.
zh_cn: 在将来某个时间执行给定任务。

source: Executes the given tasks, returning a list of Futures holding their status and results when all complete or the timeout expires, whichever happens first.
zh_cn: 执行给定的任务，当所有任务完成或超时期满时（无论哪个首先发生），返回保持任务状态和结果的 Future 列表。

source: Executes the given tasks, returning a list of Futures holding their status and results when all complete.
zh_cn: 执行给定的任务，当所有任务完成时，返回保持任务状态和结果的 Future 列表。

source: Executes the given tasks, returning the result of one that has completed successfully (i.e., without throwing an exception), if any do before the given timeout elapses.
zh_cn: 执行给定的任务，如果在给定的超时期满前某个任务已成功完成（也就是未抛出异常），则返回其结果。

source: Executes the given tasks, returning the result of one that has completed successfully (i.e., without throwing an exception), if any do.
zh_cn: 执行给定的任务，如果某个任务已成功完成（也就是未抛出异常），则返回其结果。

source: Executes the specified command and arguments in a separate process with the specified environment and working directory.
zh_cn: 在指定环境和工作目录的独立进程中执行指定的命令和变量。

source: Executes the specified command and arguments in a separate process with the specified environment.
zh_cn: 在指定环境的独立进程中执行指定命令和变量。

source: Executes the specified command and arguments in a separate process.
zh_cn: 在单独的进程中执行指定命令和变量。

source: Executes the specified string command in a separate process with the specified environment and working directory.
zh_cn: 在有指定环境和工作目录的独立进程中执行指定的字符串命令。

source: Executes the specified string command in a separate process with the specified environment.
zh_cn: 在指定环境的单独进程中执行指定的字符串命令。

source: Executes the specified string command in a separate process.
zh_cn: 在单独的进程中执行指定的字符串命令。

source: ExecutorServices provide methods arranging asynchronous execution of any function expressed as Callable, the result-bearing analog of Runnable.
zh_cn: ExecutorService 提供了安排异步执行的方法，可执行由 Callable 表示的任何函数，结果类似于 Runnable。

source: Executors
zh_cn: 执行程序

source: Extended interface TransferQueue, and implementation LinkedTransferQueue introduce a synchronous transfer method (along with related features) in which a producer may optionally block awaiting its consumer.
zh_cn: 扩展接口 TransferQueue 和实现 LinkedTransferQueue 引入一种同步 transfer 方法(以及相关特性)，在该方法中，生产者可以选择阻塞等待其消费者。

source: Extends LinkedHashMap.Entry (which in turn extends Node) so can be used as extension of either regular or linked node.
zh_cn: 扩展 LinkedHashMap.Entry(进而扩展 Node)，因此可以用作常规节点或链接节点的扩展。

source: Factory and utility methods for Executor, ExecutorService, ScheduledExecutorService, ThreadFactory, and Callable classes defined in this package.
zh_cn: 此包中所定义的 Executor、ExecutorService、ScheduledExecutorService、ThreadFactory 和 Callable 类的工厂和实用方法。

source: Factory for creating new ForkJoinWorkerThreads.
zh_cn: 用于创建新的 ForkJoinWorkerThread 的工厂。

source: Fail-fast iterators throw ConcurrentModificationException on a best-effort basis.
zh_cn: 快速失败迭代器尽最大努力抛出 ConcurrentModificationException。

source: Field declaration (includes enum constants)
zh_cn: 字段声明（包括枚举常量）

source: Fills in the execution stack trace.
zh_cn: 在异常堆栈跟踪中填充。

source: Finalization
zh_cn: 终止

source: Finally, Attempting to read a member whose definition has evolved incompatibly will result in a AnnotationTypeMismatchException or an IncompleteAnnotationException.
zh_cn: 最后，阅读其定义已经引起不兼容性的成员将导致 AnnotationTypeMismatchException 或 IncompleteAnnotationException。

source: Finally, an object is unreachable, and therefore eligible for reclamation, when it is not reachable in any of the above ways.
zh_cn: 最后，当不能以上述任何方法到达某一对象时，该对象是 不可到达 对象，因此可以回收此对象。

source: Finally, the implementor must ensure that x.compareTo(y)==0 implies that sgn(x.compareTo(z)) == sgn(y.compareTo(z)), for all z.
zh_cn: 最后，实现者必须确保 x.compareTo(y)==0 意味着对于所有的 z，都存在 sgn(x.compareTo(z)) == sgn(y.compareTo(z))。

source: Finally, the throwable can also contain a cause: another throwable that caused this throwable to be constructed.
zh_cn: 最后，throwable 还可以包含 cause（原因）：另一个导致此 throwable 抛出的 throwable。

source: Finally, this package provides classes that support signed/guarded objects and secure random number generation.
zh_cn: 最后，此包提供支持 signed/guarded 对象和安全随机数生成的对象。

source: Find a resource of the specified name from the search path used to load classes.
zh_cn: 从用来加载类的搜索路径中查找具有指定名称的资源。

source: Finds a class with the specified binary name, loading it if necessary.
zh_cn: 查找具有指定的二进制名称的类，必要时加载它。

source: Finds a resource with a given name.
zh_cn: 查找具有给定名称的资源。

source: Finds all resources of the specified name from the search path used to load classes.
zh_cn: 从用来加载类的搜索路径中查找所有具有指定名称的资源。

source: Finds all the resources with the given name.
zh_cn: 查找所有具有给定名称的资源。

source: Finds the class with the specified binary name.
zh_cn: 使用指定的二进制名称查找类。

source: Finds the node starting at root p with the given hash and key.
zh_cn: 使用给定的 hash 和 key 查找从根 p 开始的节点。

source: Finds the resource with the given name.
zh_cn: 查找具有给定名称的资源。

source: First the checkAccess method of this thread is called with no arguments.
zh_cn: 首先调用线程的 checkAccess 方法，且不带任何参数。

source: First the characters in the substring are removed and then the specified String is inserted at start.
zh_cn: 先将子字符串中的字符移除，然后将指定的 String 插入 start。

source: First, if the class of this object does not implement the interface Cloneable, then a CloneNotSupportedException is thrown.
zh_cn: 首先，如果此对象的类不能实现接口 Cloneable，则会抛出 CloneNotSupportedException。

source: First, if there is a security manager, its checkPermission method is called with a ReflectPermission("suppressAccessChecks") permission.
zh_cn: 首先，如果存在安全管理器，则在 ReflectPermission("suppressAccessChecks") 权限下调用 checkPermission 方法。

source: Five classes aid common special-purpose synchronization idioms.
zh_cn: 五个类可协助实现常见的专用同步语句。

source: Five implementations in java.util.concurrent support the extended BlockingQueue interface, that defines blocking versions of put and take: LinkedBlockingQueue, ArrayBlockingQueue, SynchronousQueue, PriorityBlockingQueue, and DelayQueue.
zh_cn: java.util.concurrent 中的五个实现都支持扩展的 BlockingQueue 接口，该接口定义了 put 和 take 的阻塞版本：LinkedBlockingQueue、ArrayBlockingQueue、SynchronousQueue、PriorityBlockingQueue 和 DelayQueue。

source: FomattableFlags are passed to the Formattable.formatTo() method and modify the output format for Formattables.
zh_cn: 将 FomattableFlags 传递给 Formattable.formatTo() 方法，并修改 Formattables 的输出格式。

source: For a given floating-point format, an ulp of a specific real number value is the distance between the two floating-point values bracketing that numerical value.
zh_cn: 对于给定的浮点格式，特定实数值的 ulp 是包括该数值的两个浮点值的差。

source: For additional information on string concatenation and conversion, see Gosling, Joy, and Steele, The Java Language Specification.
zh_cn: 有关字符串串联和转换的更多信息，请参阅 Gosling、Joy 和 Steele 合著的 The Java Language Specification。

source: For any non-null reference value x, x.equals(null) should return false.
zh_cn: 对于任何非空引用值 x，x.equals(null) 都应返回 false。

source: For any set of member methods of the specified interfaces that have the same signature:
zh_cn: 对于有相同签名的指定接口中任何成员方法集：

source: For conversion from TreeNodes to plain nodes
zh_cn: 用于从 TreeNodes 转换为普通节点

source: For each lower bound B :
zh_cn: 对于每个下边界 B：

source: For each pair of threads that successfully exchange objects via an Exchanger, actions prior to the exchange() in each thread happen-before those subsequent to the corresponding exchange() in another thread.
zh_cn: 对于通过 Exchanger 成功交换对象的每个线程对，每个线程中 exchange() 之前的操作 happen-before 另一线程中对应 exchange() 后续的操作。

source: For each upper bound B:
zh_cn: 对于每个上边界 B：

source: For every nonnegative index k less than newLength, the character at index k in the new character sequence is the same as the character at index k in the old sequence if k is less than the length of the old character sequence; otherwise, it is the null character '\u0000'.
zh_cn: 对于每个小于 newLength 的非负索引 k，如果 k 小于原字符序列的长度，则新字符序列索引 k 处的字符与原字符序列索引 k 处的字符相同；否则，新字符序列索引 k 处的字符将是 null 字符 '\u0000'。

source: For exact results large in magnitude, one of the endpoints of the bracket may be infinite.
zh_cn: 对于值很大的准确结果，括号的一端可以是无穷大。

source: For example java.util.Hashtable and Collections.synchronizedMap(new HashMap()) are synchronized.
zh_cn: 例如，java.util.Hashtable 和 Collections.synchronizedMap(new HashMap()) 是同步的。

source: For example, Runnable is implemented by class Thread.
zh_cn: 例如，Thread 类实现了 Runnable。

source: For example, Character.isLetter(0x2F81A) returns true because the code point value represents a letter (a CJK ideograph).
zh_cn: 例如，Character.isLetter(0x2F81A) 返回 true，因为代码点值表示一个字母（一个 CJK 象形文字）。

source: For example, Character.isLetter('\uD840') returns false, even though this specific value if followed by any low-surrogate value in a string would represent a letter.
zh_cn: 例如，Character.isLetter('\uD840') 返回 false，即使是特定值，如果在字符串的后面跟着任何低代理项值，那么它将表示一个字母。

source: For example, a hashtable that uses weak references to implement weak keys could poll its reference queue each time the table is accessed.
zh_cn: 例如，使用弱引用来实现弱键的哈希表能在每次访问表时轮询其引用队列。

source: For example, a thread that computes primes larger than a stated value could be written as follows:
zh_cn: 例如，计算大于某一规定值的质数的线程可以写成：

source: For example, a thread that has called Object.wait() on an object is waiting for another thread to call Object.notify() or Object.notifyAll() on that object.
zh_cn: 例如，已经在某一对象上调用了 Object.wait() 的线程正等待另一个线程，以便在该对象上调用 Object.notify() 或 Object.notifyAll()。

source: For example, an application could create a network class loader to download class files from a server.
zh_cn: 例如，应用程序可以创建一个网络类加载器，从服务器中下载类文件。

source: For example, classes AtomicLong and AtomicInteger provide atomic increment methods.
zh_cn: 例如，类 AtomicLong 和 AtomicInteger 提供了原子增量方法。

source: For example, given some transformation
zh_cn: 例如，给定一些转换

source: For example, here is a subclass that adds a simple pause/resume feature:
zh_cn: 例如，下面是一个添加了简单的暂停/恢复功能的子类：

source: For example, if z refers to a string buffer object whose current contents are "start", then the method call z.append("le") would cause the string buffer to contain "startle", whereas z.insert(4, "le") would alter the string buffer to contain "starlet".
zh_cn: 例如，如果 z 引用一个当前内容为 "start" 的字符串缓冲区对象，则此方法调用 z.append("le") 会使字符串缓冲区包含 "startle"，而 z.insert(4, "le") 将更改字符串缓冲区，使之包含 "starlet"。

source: For example, if z refers to a string builder object whose current contents are "start", then the method call z.append("le") would cause the string builder to contain "startle", whereas z.insert(4, "le") would alter the string builder to contain "starlet".
zh_cn: 例如，如果 z 引用一个当前内容为“start”的字符串生成器对象，则该方法调用 z.append("le") 将使字符串生成器包含“startle”，而 z.insert(4, "le") 将更改字符串生成器，使之包含“starlet”。

source: For example, if one adds two keys a and b such that (!a.equals(b) && a.compareTo(b) == 0) to a sorted set that does not use an explicit comparator, the second add operation returns false (and the size of the sorted set does not increase) because a and b are equivalent from the sorted set's perspective.
zh_cn: 例如，如果将两个键 a 和 b 添加到没有使用显式比较器的有序集合中，使 (!a.equals(b) && a.compareTo(b) == 0)，那么第二个 add 操作将返回 false（有序集合的大小没有增加），因为从有序集合的角度来看，a 和 b 是相等的。

source: For example, if the number of type arguments to a parameterized type is wrong.
zh_cn: 例如，如果参数化类型的类型参数错误。

source: For example, if this type is O<T>.I<S>, return a representation of O<T>.
zh_cn: 例如，如果此类型为 O<T>.I<S>，则返回 O<T> 的表示形式。

source: For example, it is common for each conceptual argument to be an element in this list, but there are operating systems where programs are expected to tokenize command line strings themselves - on such a system a Java implementation might require commands to contain exactly two elements.
zh_cn: 例如，每一个总体变量，通常都要成为此列表中的元素，但有一些操作系统，希望程序能自己标记命令行字符串——在这种系统中，Java 实现可能需要命令确切地包含这两个元素。

source: For example, on UNIX systems, the virtual machine loads classes from the directory defined by the CLASSPATH environment variable.
zh_cn: 例如，在 UNIX 系统中，虚拟机从 CLASSPATH 环境变量定义的目录中加载类。

source: For example, reversing "\uDC00\uD800" produces "\uD800\uDC00" which is a valid surrogate pair.
zh_cn: 例如，反转 "\\uDC00\\uD800" 将生成有效的代理项对 "\\uD800\\uDC00"。

source: For example, setting the command attribute to an empty list will not throw an exception unless start() is invoked.
zh_cn: 例如，将命令属性设置为一个空列表将不会抛出异常，除非包含了 start()。

source: For example, suppose a persistent collection conforms to the Collection interface, and that its persistence is implemented atop java.io.
zh_cn: 例如，假定持久集合符合 Collection 接口，而其持久性在 java.io 的基础上实现。

source: For example, the VM may limit the number of interfaces that a class may implement to 65535; in that case, the size of the interfaces array must not exceed 65535.
zh_cn: 例如，虚拟机可以限制某一类实现至多 65535 的接口数；在这种情况下，interfaces 数组的大小必须不超过 65535。

source: For example, the class below generates unique identifiers local to each thread.
zh_cn: 例如，以下类生成对每个线程唯一的局部标识符。

source: For example, the finalize method for an object that represents an input/output connection might perform explicit I/O transactions to break the connection before the object is permanently discarded.
zh_cn: 例如，表示输入/输出连接的对象的 finalize 方法可执行显式 I/O 事务，以便在永久丢弃对象之前中断连接。

source: For example, the following meta-annotation is illegal:
zh_cn: 例如，以下元注释是非法的：

source: For example, there is no atomic class for representing byte.
zh_cn: 例如，没有表示 byte 的原子类。

source: For example, this bit might be used inside a data structure to mean that the object being referenced has logically been deleted.
zh_cn: 例如，可以在数据结构内部使用此位，这意味着引用的对象在逻辑上已被删除。

source: For example, this meta-annotation indicates that the declared type is itself a meta-annotation type.
zh_cn: 例如，此元注释指示该声明类型是其自身，即元注释类型。

source: For example:
zh_cn: 例如：

source: For further documentation, please see:
zh_cn: 有关进一步文档，请参阅：

source: For instance if it is set to myapp.protocols, then the URL code will try, in the case of http, first to load myapp.protocols.http.Handler, then, if this fails, http.Handler from the default location.
zh_cn: 例如，如果将其设置为 myapp.protocols，则 URL 代码将首先尝试（对于 http 而言）加载 myapp.protocols.http.Handler，然后，如果失败，则尝试从默认位置加载 http.Handler。

source: For more information on Unicode terminology, refer to the Unicode Glossary.
zh_cn: 有关 Unicode 技术的详细信息，请参阅 Unicode Glossary。

source: For more information, see Why are Thread.stop, Thread.suspend and Thread.resume Deprecated?.
zh_cn: 有关更多信息，请参阅 Why are Thread.stop, Thread.suspend and Thread.resume Deprecated?。

source: For objects of type Class, by executing a synchronized static method of that class.
zh_cn: 对于 Class 类型的对象，可以通过执行该类的同步静态方法。

source: For overviews, tutorials, examples, guides, and tool documentation, please see:
zh_cn: 有关概述、教程、示例、指南和工具文档的信息，请参阅：

source: For the mathematically inclined, the relation that defines the natural ordering on a given class C is:
zh_cn: 从数学上讲，定义给定类 C 上自然排序的关系式 如下：

source: For the purposes of compile-time checking of exceptions, Throwable and any subclass of Throwable that is not also a subclass of either RuntimeException or Error are regarded as checked exceptions.
zh_cn: 为编译时异常的检查的目的，Throwable 和 Throwable 的任何子类，只要不是 RuntimeException 或 Error 的子类，都被视为检查型异常。

source: For this reason, attempts to modify the map may fail with UnsupportedOperationException or IllegalArgumentException if the modification is not permitted by the operating system.
zh_cn: 出于此原因，如果不允许操作系统修改的话，试图修改映射可能失败，并抛出 UnsupportedOperationException 或 IllegalArgumentException。

source: For treeifyBin
zh_cn: 用于 treeifyBin

source: Forcibly terminates the currently running Java virtual machine.
zh_cn: 强行终止目前正在运行的 Java 虚拟机。

source: Formal parameter declaration
zh_cn: 形式参数的声明

source: Forms tree of the nodes linked from this node.
zh_cn: 将从此节点链接的节点转为树形式。

source: Four predefined handler policies are provided:
zh_cn: 下面提供了四种预定义的处理程序策略：

source: Frequently it is necessary to represent a value of primitive type as if it were an object.
zh_cn: 把基本类型的值当成一个对象来表示通常很有必要。

source: From that URL, you can either get the URLConnection for fine control, or get directly the InputStream.
zh_cn: 从该 URL 可以获取 URLConnection 以进行良好控制，也可以直接获取 InputStream。

source: Further, doing so would tie the API of the upper layer to the details of its implementation, assuming the lower layer's exception was a checked exception.
zh_cn: 此外，这样做将高层 API 与其实现细节关联起来，假定低层异常是经过检查的异常。

source: Further, the behavior of this call was never specified.
zh_cn: 更进一步地说，此调用的行为从不被指定。

source: Further, the results of this call were never well-defined.
zh_cn: 此外，该调用的结果从来都不是意义明确的。

source: Further, those subclasses that might likely have a cause associated with them should have two more constructors, one that takes a Throwable (the cause), and one that takes a String (the detail message) and a Throwable (the cause).
zh_cn: 此外，这些子类很可能有与其相关联的 cause，因此也应有两个构造方法，一个带 Throwable (cause)，一个带 String（详细消息）和 Throwable (cause)。

source: General category "Cc" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Cc”。

source: General category "Cf" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Cf”。

source: General category "Cn" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Cn”。

source: General category "Co" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Co”。

source: General category "Cs" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Cs”。

source: General category "Ll" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Ll”。

source: General category "Lm" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Lm”。

source: General category "Lo" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Lo”。

source: General category "Lt" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Lt”。

source: General category "Lu" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Lu”。

source: General category "Mc" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Mc”。

source: General category "Me" in the Unicode specification.
zh_cn: Unicode 规范中的常规类别“Me”。
